function App() {
  return (
    <main>
      <h1>저의 이야기</h1>
      <p>안녕하세요. 저는 김성현입니다.</p>
      <p>
        저는 기계공학을 전공했습니다. 기계공학에 그렇게 흥미를 붙이지는 못했습니다. 그러던 어느 날 우연히 개발자들을
        만났습니다. 그들은 단 1초의 망설임도 없이 자신의 일을 사랑한다고 말할 수 있는 사람들이었습니다. 그들의 열정과
        확신은 그때 제 눈에는 따라가야만 할 북극성처럼 빛났습니다. 저는 그 순간, 개발자의 길을 걸어야겠다고
        마음먹었습니다.
      </p>
      <p>
        자신의 일을 사랑하는 사람들이 내는 빛은 제 앞에 닥쳐오는 수많은 고민들 속에서도 멀리 보이는 별처럼 언제나 저를
        이끌었습니다. 그저 그렇게 멋진 사람들이 내는 별빛을 따라 여기까지 왔습니다.
      </p>
      <p>
        C와 C++, 알고리즘을 배웠고 실력을 키워 이 판에서 작은 이름을 가지게 되었습니다. "마녀"라는 닉네임을 가지고
        이것저것 배워가며 프론트엔드 개발자가 되었습니다. 몇 개의 프로젝트를 했고 수백 개의 글을 작성하여 그럭저럭 검색
        결과에 뜨는 블로그를 운영하게 되었습니다.
      </p>
      <p>
        저는 별에 좀 더 가까워졌을까요? 절대 닿을 수 없을 것만 같던, 하늘의 별처럼 빛나던 사람들 중 몇몇은 저와 같이
        달리는 친구가 되었습니다. 그리고 그들과 저는 이제 더 높고 멀리 떠 있는 별들을 보며 나아갑니다. 언젠가는 거기에도
        닿을 수 있을 것입니다. 그저 앞으로도, 그 별빛을 따라가면서 살고자 할 뿐입니다.
      </p>
      <p>
        발아래가 아닌 먼 하늘을 보면서 시간을 따라 걸어오다 보니 자바스크립트에 깊게 파고들게 되었습니다. 저는 많은
        사람들이 관심을 가지지 않는 자바스크립트의 깊은 부분을 탐구하며 그 지식을 체계화하고 기록하려고 노력합니다. 저는
        이러한 지식들이 아무도 쉽게 다가가지 않지만 분명 가치 있는 오래된 고성과 같다고 생각합니다.
      </p>
      <p>
        많은 이들이 쉽게 깊은 곳까지 다가가지 않는, 이 언어와 깊은 지식으로 쌓인 고성을 저는 사랑합니다. 그곳을 탐험하는
        마녀가 되고자 합니다. 고성의 깊은 곳에는 분명 복잡하고도 아름다운 무언가가 있을 것이며 아직 발견되지 않은
        보물들도 숨겨져 있을 겁니다.
      </p>
      <p>
        저는 그 보물을 찾아내고, 그 가치를 세상에 알리기 위해 밤낮으로 연구합니다. 저는 이 고성을 탐험하며 프로그래밍의
        숨겨진 비밀들을 찾아내고 새로운 길을 개척해 나갈 것입니다. 언젠가는 저도 진짜 마녀처럼, 코드로 마법을 부릴 수
        있을지도 모릅니다.
      </p>
      <p>이곳에 찾아오신 당신에게 그 편린을 보여드릴 수 있어 영광입니다.</p>
    </main>
  );
}

export default App;
